tutorials/incompressible/pisoFoam/les/pitzDailyDirectMapped/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libincompressibleLESModels.so"
    "liblduSolvers.so"
)

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    probes1
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
            ( 0.0254 0.0253 0 )
            ( 0.0508 0.0253 0 )
            ( 0.0762 0.0253 0 )
            ( 0.1016 0.0253 0 )
            ( 0.127 0.0253 0 )
            ( 0.1524 0.0253 0 )
            ( 0.1778 0.0253 0 )
        );
        fields
        (
            p
        );
    }

    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}


// ************************************************************************* //
